lib/assets/setFields_passportdvs_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dyn="http://dynamicform.services.registrations.edentiti.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <dyn:setFields>
         <accountId>CUSTOMER_ID</accountId>
         <password>PASSWORD</password>
         <verificationId>4LM41kyH</verificationId>
         <sourceId>passportdvs</sourceId>
         <inputFields>
            <input>
               <name>greenid_passportdvs_givenname</name>
               <value>Test</value>
            </input>
            <input>
               <name>greenid_passportdvs_middlename</name>
               <value>Harold</value>
            </input>
            <input>
               <name>greenid_passportdvs_surname</name>
               <value>McTester</value>
            </input>
            <input>
               <name>greenid_passportdvs_dob</name>
               <value>01/01/1980</value>
            </input>
            <input>
               <name>greenid_passportdvs_number</name>
               <value>A1111111</value>
            </input>
            <input>
               <name>greenid_passportdvs_gender</name>
               <value>M</value>
            </input>
            <input>
               <name>greenid_passportdvs_tandc</name>
               <value>on</value>
            </input>            
         </inputFields>
      </dyn:setFields>
   </soapenv:Body>
</soapenv:Envelope>